content/posts/EvolutionaryDynamicsjl.md
+++
title = "EvolutionaryDynamics.jl"
author = ["Cameron Smith"]
lastmod = 2020-09-20T17:34:23-04:00
slug = "EvolutionaryDynamicsjl"
draft = false
+++

## [software library]({{< relref "software_library" >}}), [julia]({{< relref "julia" >}}), [evolutionary timescale]({{< relref "evolutionary_timescale" >}}) {#software-library--software-library-dot-md--julia--julia-dot-md--evolutionary-timescale--evolutionary-timescale-dot-md}


## objective {#objective}


### Analyze and simulate models of [evolution in fluctuating environments]({{< relref "evolution_in_fluctuating_environments" >}}) in [julia]({{< relref "julia" >}}) {#analyze-and-simulate-models-of-evolution-in-fluctuating-environments--evolution-in-fluctuating-environments-dot-md--in-julia--julia-dot-md}


## progress {#progress}


### created git repository <span class="timestamp-wrapper"><span class="timestamp">&lt;2020-09-11 Fri&gt;</span></span> {#created-git-repository}


## todo {#todo}


### add data sets from [The evolutionary dynamics and fitness landscape of clonal hematopoiesis by Caroline Watson, Daniel Fisher, Jamie Blundell, et al in 2020]({{< relref "The_evolutionary_dynamics_and_fitness_landscape_of_clonal_hematopoiesis_by_Caroline_Watson,_Daniel_Fisher,_Jamie_Blundell,_et_al_in_2020" >}}) paper in HDF5 format {#add-data-sets-from-the-evolutionary-dynamics-and-fitness-landscape-of-clonal-hematopoiesis-by-caroline-watson-daniel-fisher-jamie-blundell-et-al-in-2020--the-evolutionary-dynamics-and-fitness-landscape-of-clonal-hematopoiesis-by-caroline-watson-daniel-fisher-jamie-blundell-et-al-in-2020-dot-md--paper-in-hdf5-format}


### create simple models {#create-simple-models}


### convert <https://github.com/caravagn/evoverse.datasets> to <https://github.com/JuliaIO/HDF5.jl> using <https://github.com/JuliaData/RData.jl> {#convert-https-github-dot-com-caravagn-evoverse-dot-datasets-to-https-github-dot-com-juliaio-hdf5-dot-jl-using-https-github-dot-com-juliadata-rdata-dot-jl}


##  {#}
